In [284]:
! pip install numpy
! pip install pandas

Requirement already satisfied: numpy in c:\users\it\anaconda3\lib\site-packages (1.26.4)
Requirement already satisfied: pandas in c:\users\it\anaconda3\lib\site-packages (2.2.2)
Requirement already satisfied: numpy>=1.26.0 in c:\users\it\anaconda3\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\it\anaconda3\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\it\anaconda3\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\it\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in c:\users\it\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [285]:
import numpy as np
import pandas as pd

In [286]:
# Series 생성(1차원 자료)
list1 = [2, 3 ,4, 1, 5]
s1 = pd.Series(list1, index=['a', 'b', 'c', 'd', 'e'])  # 인덱스를 원하는 대로 바꿀 수도 있음
print(s1)   # 인덱스와 열로 구성되어있음
print(type(s1))
print(s1.dtype)
print(s1.values)
print(s1.index)

a    2
b    3
c    4
d    1
e    5
dtype: int64
<class 'pandas.core.series.Series'>
int64
[2 3 4 1 5]
Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [287]:
# Series 생성(1차원 자료) (2)

s2 = pd.Series(list1)
print(s2)
print(type(s2))
print(s2.dtype)
print(s2.values)
print(s2.index)

0    2
1    3
2    4
3    1
4    5
dtype: int64
<class 'pandas.core.series.Series'>
int64
[2 3 4 1 5]
RangeIndex(start=0, stop=5, step=1)

In [288]:
# Series 생성(1차원 자료) (3)

sdata = {'kim': 85, 'lee': 75, 'choi': 65}
s3 = pd.Series(sdata)
print(s3)
print(type(s3))
print(s3.dtype)
print(s3.values)
print(s3.index) # 딕셔너리는 인덱스가 자동으로 키값으로 들어감

kim     85
lee     75
choi    65
dtype: int64
<class 'pandas.core.series.Series'>
int64
[85 75 65]
Index(['kim', 'lee', 'choi'], dtype='object')

In [289]:
# DataFrame 생성

data = {
    'name': ['민준', '현우', '서연', '동현', '지현'],
    'year': [2023, 2024, 2022, 2025,  2024],
    'points': [1.5, 1.7, 3.6, 2.4, 2.9]
    }

df = pd.DataFrame(data)
df

  name  year  points
0   민준  2023     1.5
1   현우  2024     1.7
2   서연  2022     3.6
3   동현  2025     2.4
4   지현  2024     2.9

In [290]:
# DataFrame 생성 (2)
names = ['민준', '현우', '서연', '동현', '지현']
years = [2023, 2024, 2022, 2025,  2024]
points = [1.5, 1.7, 3.6, 2.4, 2.9]

data = [names, years, points]   # 2차원 리스트

df1 = pd.DataFrame(data).T
df1.columns = ['names', 'years', 'points']

df1

  names years points
0    민준  2023    1.5
1    현우  2024    1.7
2    서연  2022    3.6
3    동현  2025    2.4
4    지현  2024    2.9

In [291]:
# DataFrame 생성 (3)

arr = np.array(data).T

df2 = pd.DataFrame(
    arr,
    columns=['names', 'years', 'points'],
    index=['one', 'two', 'three', 'four', 'five']
    )

print(df2)
print(df2.index)
print(df2.columns)
print(df2.values)

      names years points
one      민준  2023    1.5
two      현우  2024    1.7
three    서연  2022    3.6
four     동현  2025    2.4
five     지현  2024    2.9
Index(['one', 'two', 'three', 'four', 'five'], dtype='object')
Index(['names', 'years', 'points'], dtype='object')
[['민준' '2023' '1.5']
 ['현우' '2024' '1.7']
 ['서연' '2022' '3.6']
 ['동현' '2025' '2.4']
 ['지현' '2024' '2.9']]

In [292]:
# 데이터프레임의 한 열을 갖고오면 그건 시리즈임 ㅇㅇ

names = df2['names']
years = df2['years']
points = df2['points']

print(names)
print(years)
print(points)

one      민준
two      현우
three    서연
four     동현
five     지현
Name: names, dtype: object
one      2023
two      2024
three    2022
four     2025
five     2024
Name: years, dtype: object
one      1.5
two      1.7
three    3.6
four     2.4
five     2.9
Name: points, dtype: object

In [293]:
# 데이터프레임의 전반적인 정보를 그냥 딸깍 한번으로 보고싶을 때
df2.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, one to five
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   names   5 non-null      object
 1   years   5 non-null      object
 2   points  5 non-null      object
dtypes: object(3)
memory usage: 160.0+ bytes

In [294]:
# 데이터 프레임 읽기
chocolate_df = pd.read_csv('data/chocolate_rating.csv', header=None)
chocolate_df.columns = ['id', 'year', 'kakao%', 'rating']
chocolate_df.to_csv('data/chololate_df.csv', index=False)    # index=False를 안하면 인덱스까지 저장되어서 열이 하나 더 늘어난다.

In [295]:
character_df = pd.read_excel('data/characters.xlsx')
character_df.to_excel('data/character_df.xlsx', index=False)
character_df

   ID   이름  상징색    취미    특징
0   1  뽀로로  파랑색    낚시    펭귄
1   2   에디  주황색  과학실험  사막여우
2   3   크롱  초록색   눈싸움    공룡
3   4   루피  분홍색    요리    비버
4   5   패티  보라색    운동    펭귄

In [296]:
# 데이터 프레임 조회

df2.info()
print()
chocolate_df.info()
print()
character_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, one to five
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   names   5 non-null      object
 1   years   5 non-null      object
 2   points  5 non-null      object
dtypes: object(3)
memory usage: 160.0+ bytes

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1795 entries, 0 to 1794
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      1795 non-null   int64
 1   year    1795 non-null   int64
 2   kakao%  1795 non-null   float64
 3   rating  1795 non-null   float64
dtypes: float64(2), int64(2)
memory usage: 56.2 KB

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   ID      5 non-null      int64
 1   이름      5 non-null      object
 2   상징색     5 non-null      object
 3   취미      5 non-null      object
 4   특징      5 non-null      object
dtypes: int64(1), object(4)
memory usage: 332.0+ bytes

In [297]:
# 데이터프레임 조회(2)
chocolate_df.columns = ['번호', '연도', '함유량', '평점']

chocolate_df.head() # 데이터프레임 앞의 5개 행만 보여줌
chocolate_df.tail() # 데이터프레임 맨 뒤의 5개 행만 보여줌
chocolate_df[:10]   # 0부터 인덱스10미만까지의 행을 보여줌(리스트 슬라이싱이랑 똑같음)
chocolate_df[10:20] # 인덱스10부터 인덱스 20미만까지의 행을 보여줌
# chocolate_df[10:20, 3]  # 데이터프레임은 어레이랑 달리 콤마를 찍는다고 열 슬라이싱이 되지는 않음

    번호    연도  함유량    평점
10  11  2013  0.7  2.75
11  12  2013  0.7  3.00
12  13  2013  0.7  3.25
13  14  2013  0.7  3.75
14  15  2013  0.7  2.75
15  16  2013  0.7  3.00
16  17  2013  0.7  3.25
17  18  2013  0.7  4.00
18  19  2013  0.7  3.25
19  20  2013  0.7  3.50

In [298]:
# describe() = 데이터프레임에 관한 모든 가능한 연산 정보? 수학적 정보? 그런걸 다 보여주는 함수
chocolate_df.describe()
df2.describe()
# character_df.describe()

       names years points
count      5     5      5
unique     5     4      5
top       민준  2024    1.5
freq       1     2      1

In [299]:
# 열 자체의 자료형을 바꾸고 싶을 때
df2['years'] = df2['years'].astype(np.int64)    # 그냥 파이썬에서 기본 제공하는 int를 쓸려면 되게 복잡해서 보통 그냥 넘파이의 자료형을 사용함
df2['points'] = df2['points'].astype(np.float64)
df2.info()
df2.describe()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, one to five
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   names   5 non-null      object
 1   years   5 non-null      int64
 2   points  5 non-null      float64
dtypes: float64(1), int64(1), object(1)
memory usage: 160.0+ bytes

             years    points
count     5.000000  5.000000
mean   2023.600000  2.420000
std       1.140175  0.864292
min    2022.000000  1.500000
25%    2023.000000  1.700000
50%    2024.000000  2.400000
75%    2024.000000  2.900000
max    2025.000000  3.600000

In [300]:
# 데이터프레임 정렬
# 인덱스를 기준으로 정렬하기
df2.sort_index(axis=0, ascending=True)  # axis=0 -> 열기준으로 정렬 = 인덱스를 오름차순으로 정렬한다는 의미임

# 값을 기준으로 정렬하기
df2.sort_values(by=['names'], ascending=True)   # 'names'열을 오름차순으로 소트한다

      names  years  points
four     동현   2025     2.4
one      민준   2023     1.5
three    서연   2022     3.6
five     지현   2024     2.9
two      현우   2024     1.7

In [301]:
# 데이터 조회
df2['names'] # 시리즈로 출력하기
df2.names   # 이 방법은 검색하고싶은 필드가 1개일때만 가능함...

df2[['names', 'points']] # 데이터프레임으로 출력하기(리스트로 싸버려야함)

      names  points
one      민준     1.5
two      현우     1.7
three    서연     3.6
four     동현     2.4
five     지현     2.9

In [302]:
# 데이터 조회(2)
# 데이터프레임에서 단 한개의 행, 단 한 개의 셀만 검색하고 싶을때
# 데이터프레임.iloc[행 인덱스, 열 인덱스] (iloc는 index location이라는 뜻 같음)
print(df2.iloc[2])
print()
print(df2.iloc[2, 1:3])
print()
print(df2.iloc[[0, 3], [0, 2]])

names       서연
years     2022
points     3.6
Name: three, dtype: object

years     2022
points     3.6
Name: three, dtype: object

     names  points
one     민준     1.5
four    동현     2.4

In [303]:
# 데이터 조회(3)
# loc: 행 열 조회
# 데이터프레임.loc[행조건, 열조건]
print(df2.loc[['one', 'three'], 'names'])   # 이건 아예 인덱스의 이름으로 열을 불러올 수 있음
print()
print(df2.loc['one':'three'])   # 이때 슬라이싱은 우측항 미만이 아니라 우측항 이하로 인식함
print()

# 데이터프레임 열 데이터형변환
df2.points = df2.points.astype('Float64')   # 넘파이 안쓰고 이렇게 그냥 문자열을 집어넣어도 됨

# 행조건으로 데이터 조회하기
print(df2.loc[df2['years'] == 2024])
print()
print(df2.loc[df2['points'] >= 2.0, :])

one      민준
three    서연
Name: names, dtype: object

      names  years  points
one      민준   2023     1.5
two      현우   2024     1.7
three    서연   2022     3.6

     names  years  points
two     현우   2024     1.7
five    지현   2024     2.9

      names  years  points
three    서연   2022     3.6
four     동현   2025     2.4
five     지현   2024     2.9

In [304]:
# chocolate_df에서 평점이 4.5 이상인 행 검색
print(chocolate_df.loc[chocolate_df['평점'] >= 4])
print()

# chocolate_df에서 함유량이 0.8 이상인 행의 특정 열만 꺼내오기
print(chocolate_df.loc[chocolate_df['함유량'] >= 0.8, ['번호', '평점']])

        번호    연도   함유량   평점
9       10  2014  0.70  4.0
17      18  2013  0.70  4.0
20      21  2013  0.63  4.0
54      55  2011  0.70  4.0
56      57  2010  0.70  4.0
...    ...   ...   ...  ...
1687  1688  2011  0.64  4.0
1693  1694  2007  0.64  4.0
1699  1700  2006  0.70  4.0
1739  1740  2016  0.70  4.0
1756  1757  2011  0.70  4.0

[100 rows x 4 columns]

        번호    평점
26      27  3.25
27      28  3.50
51      52  3.25
65      66  2.75
66      67  3.00
...    ...   ...
1741  1742  2.25
1769  1770  2.75
1770  1771  3.00
1778  1779  2.75
1786  1787  3.25

[183 rows x 2 columns]

In [305]:
# 데이터 조회(4)
# isin()
print(df2[df2['names'].isin(['민준', '현우'])])
print()
print(df2[df2.names.isin(['민준', '현우'])])
print()

# 행, 열조건
print(df2[df2.points > 2])
print()

# 행, 열조건 &, |
print(df2[(df2['years'] == 2015) & (df2['points'] > 2)])
print()
print(df2[(df2['years'] == 2015) | (df2['points'] > 2)])
print()

# 특정 문자열 contains
print(df2[df2['names'].str.contains('현')]) # .str를 넣는 이유는 값을 한번 문자열로 바꿔준다는 의미임

    names  years  points
one    민준   2023     1.5
two    현우   2024     1.7

    names  years  points
one    민준   2023     1.5
two    현우   2024     1.7

      names  years  points
three    서연   2022     3.6
four     동현   2025     2.4
five     지현   2024     2.9

Empty DataFrame
Columns: [names, years, points]
Index: []

      names  years  points
three    서연   2022     3.6
four     동현   2025     2.4
five     지현   2024     2.9

     names  years  points
two     현우   2024     1.7
four    동현   2025     2.4
five    지현   2024     2.9

In [306]:
# 데이터프레임 수정
df2['points2'] = df2.points + 0.5   # points2라는 새로운 열을 삽입하였음
# 필드 추가할때는 df2.points2 이렇게 하면 안됨... 당연함 애초에 없는 멤버를 어떻게 호출하겠음
df2.points2 = df2.points * 0.5

df2.loc['one', 'points2'] = df2.loc['one', 'points'] + 1    # 특정 행만 수정
df2.loc['two':'three', 'points2'] = [1.9, 2.9]
df2['aaa'] = 1  # 열에 숫자 1개만 넣으면 그냥 그걸로 모조리 채움 (열의 셀 개수랑 넣을 값의 갯수가 안맞으면 에러뜸)
df2

      names  years  points  points2  aaa
one      민준   2023     1.5      2.5    1
two      현우   2024     1.7      1.9    1
three    서연   2022     3.6      2.9    1
four     동현   2025     2.4      1.2    1
five     지현   2024     2.9     1.45    1

In [307]:
# 열을 인덱스로 설정
df11 = df1.set_index('names', inplace=False) # inplace=True를 하면 원본 데이터도 바뀌어버림

# # 열을 삭제하는 명령어
# df1.drop('level_0', axis=1, inplace=True)
df1

  names years points
0    민준  2023    1.5
1    현우  2024    1.7
2    서연  2022    3.6
3    동현  2025    2.4
4    지현  2024    2.9

In [308]:
# 데이터 치환
df1['gender'] = ['남자', '남자', '여자', '남자', '여자']
rep_cond = {'gender': {'남자': 1, '여자': 2}}   # 딕셔너리 타입으로 넘겨주면 됨
df = df1.replace(rep_cond)
df

C:\Users\it\AppData\Local\Temp\ipykernel_7680\30108302.py:4: FutureWarning: Downcasting behavior in `replace` is deprecated and will be removed in a future version. To retain the old behavior, explicitly call `result.infer_objects(copy=False)`. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  df = df1.replace(rep_cond)

  names years points  gender
0    민준  2023    1.5       1
1    현우  2024    1.7       1
2    서연  2022    3.6       2
3    동현  2025    2.4       1
4    지현  2024    2.9       2

In [309]:
name = ['kim', 'lee', 'choi', 'park', 'jeong']
year = [1, 2, 1, 2, 1]
kor = [85, 95, 75, 70, 80]
eng = [82, 90, 75, 71, 80]
math = [85, 91, 72, 75, 80]

arr = np.array([name, year, kor, eng, math]).T

data_df = pd.DataFrame(arr, columns=['name', 'year', 'kor', 'eng', 'math'])
data_df.year = data_df.year.astype(np.int32)
data_df.kor = data_df.kor.astype(np.int32)
data_df.eng = data_df.eng.astype(np.int32)
data_df.math = data_df.math.astype(np.int32)
data_df['total'] = data_df.kor + data_df.eng + data_df.math
data_df['avg'] = data_df['total'] / 3
data_df.describe()

           year        kor        eng       math       total        avg
count  5.000000   5.000000   5.000000   5.000000    5.000000   5.000000
mean   1.400000  81.000000  79.600000  80.600000  241.200000  80.400000
std    0.547723   9.617692   7.231874   7.635444   24.149534   8.049845
min    1.000000  70.000000  71.000000  72.000000  216.000000  72.000000
25%    1.000000  75.000000  75.000000  75.000000  222.000000  74.000000
50%    1.000000  80.000000  80.000000  80.000000  240.000000  80.000000
75%    2.000000  85.000000  82.000000  85.000000  252.000000  84.000000
max    2.000000  95.000000  90.000000  91.000000  276.000000  92.000000

In [310]:
# 열 값 카운트
print(data_df.name.value_counts())
print()
print(data_df.year.value_counts())
print()
print(data_df.kor.value_counts())
print()
print(data_df.eng.value_counts())
print()
print(data_df.math.value_counts())
print()
print(data_df.total.value_counts())
print()

name
kim      1
lee      1
choi     1
park     1
jeong    1
Name: count, dtype: int64

year
1    3
2    2
Name: count, dtype: int64

kor
85    1
95    1
75    1
70    1
80    1
Name: count, dtype: int64

eng
82    1
90    1
75    1
71    1
80    1
Name: count, dtype: int64

math
85    1
91    1
72    1
75    1
80    1
Name: count, dtype: int64

total
252    1
276    1
222    1
216    1
240    1
Name: count, dtype: int64

In [311]:
# groupby
print(data_df.groupby('year')['total'].sum())    # DB의 SUM(total)...GROUP BY year랑 똑같음
print()

# 계산에 참여할 필드가 여러개일때
print(data_df.groupby('year')[['kor', 'eng', 'math']].mean())
print()

# 계산에 참여할 함수가 여러개일때
print(data_df.groupby('year')[['kor', 'eng', 'math']].agg(['sum', 'mean', 'median']))
print()

# 계산에 참여할 필드마다 각각 다른 함수를 쓰고 싶을때
agg_cond = {'kor': 'sum', 'eng': ['sum', 'count'], 'math': ['sum', 'count', 'mean']}
print(data_df.groupby('year')[['kor', 'eng', 'math']].agg(agg_cond))

year
1    714
2    492
Name: total, dtype: int32

       kor   eng  math
year
1     80.0  79.0  79.0
2     82.5  80.5  83.0

      kor               eng              math
      sum  mean median  sum  mean median  sum  mean median
year
1     240  80.0   80.0  237  79.0   80.0  237  79.0   80.0
2     165  82.5   82.5  161  80.5   80.5  166  83.0   83.0

      kor  eng       math
      sum  sum count  sum count  mean
year
1     240  237     3  237     3  79.0
2     165  161     2  166     2  83.0

<h3>
1. df2를 사용하여 연도별 points의 합과 평균을 구하라.<br>
2. 연도별 points와 points2의 평균을 구하라.<br>
3. 연도별 points의 중앙값 points2의 개수를 구하라.
</h3>

In [312]:
df2.drop('aaa', axis=1, inplace=True)
df2

      names  years  points  points2
one      민준   2023     1.5      2.5
two      현우   2024     1.7      1.9
three    서연   2022     3.6      2.9
four     동현   2025     2.4      1.2
five     지현   2024     2.9     1.45

In [313]:
# 1번문제
print(df2.groupby('years')['points'].agg(['sum', 'mean']))

       sum  mean
years
2022   3.6   3.6
2023   1.5   1.5
2024   4.6   2.3
2025   2.4   2.4

In [314]:
# 2번문제
print(df2.groupby('years')[['points', 'points2']].mean())

       points  points2
years
2022      3.6      2.9
2023      1.5      2.5
2024      2.3    1.675
2025      2.4      1.2

In [315]:
# 3번문제
print(df2.groupby('years').agg({'points': 'median', 'points2': 'count'}))

       points  points2
years
2022      3.6        1
2023      1.5        1
2024      2.3        2
2025      2.4        1

In [317]:
df20 = df2
df21 = df2[['names', 'points2']]
df20.set_index('names', inplace=True)
df21.set_index('names', inplace=True)

In [319]:
join_df2 = df20.merge(df21, left_index=True, right_index=True)
join_df2

       years  points  points2_x  points2_y
names
민준      2023     1.5        2.5        2.5
현우      2024     1.7        1.9        1.9
서연      2022     3.6        2.9        2.9
동현      2025     2.4        1.2        1.2
지현      2024     2.9       1.45       1.45

In [320]:
con_df1 = df2[:3]
con_df2 = df2[3:]

In [324]:
# concat (단 열의 수가 같아야만 컨캣이 가능함)
con = pd.concat([con_df1, con_df2], axis=0)   # 행끼리 concat한다는 소리임
print(con_df1)
print(con_df2)
print(con)

       years  points  points2
names
민준      2023     1.5      2.5
현우      2024     1.7      1.9
서연      2022     3.6      2.9
       years  points  points2
names
동현      2025     2.4      1.2
지현      2024     2.9     1.45
       years  points  points2
names
민준      2023     1.5      2.5
현우      2024     1.7      1.9
서연      2022     3.6      2.9
동현      2025     2.4      1.2
지현      2024     2.9     1.45

In [327]:
# concat(2)
con2 = pd.concat([df20, df21], axis=1)  # 열끼리 concat한다는 소리임
print(df20)
print(df21)
print(con2)

       years  points  points2
names
민준      2023     1.5      2.5
현우      2024     1.7      1.9
서연      2022     3.6      2.9
동현      2025     2.4      1.2
지현      2024     2.9     1.45
       points2
names
민준         2.5
현우         1.9
서연         2.9
동현         1.2
지현        1.45
       years  points  points2  points2
names
민준      2023     1.5      2.5      2.5
현우      2024     1.7      1.9      1.9
서연      2022     3.6      2.9      2.9
동현      2025     2.4      1.2      1.2
지현      2024     2.9     1.45     1.45

In [331]:
# concat은 이런식으로 걍 쌔리 이어붙이는거임
con3 = pd.concat([df, df1], axis=1)
print(con3)
con4 = pd.concat([df, df1], axis=0)
print(con4)

  names years points gender names years points gender
0    민준  2023    1.5      1    민준  2023    1.5     남자
1    현우  2024    1.7      1    현우  2024    1.7     남자
2    서연  2022    3.6      2    서연  2022    3.6     여자
3    동현  2025    2.4      1    동현  2025    2.4     남자
4    지현  2024    2.9      2    지현  2024    2.9     여자
  names years points gender
0    민준  2023    1.5      1
1    현우  2024    1.7      1
2    서연  2022    3.6      2
3    동현  2025    2.4      1
4    지현  2024    2.9      2
0    민준  2023    1.5     남자
1    현우  2024    1.7     남자
2    서연  2022    3.6     여자
3    동현  2025    2.4     남자
4    지현  2024    2.9     여자